{
    
    "Hjem": "Home",
    "Rediger klubbside": "Edit Club Page",
    "Baner": "Courses",
    "Klubbsider": "Club Pages",
    "Min statistikk": "My Statistics",
    "Mitt Medlemskap": "My Membership",
    "Logg ut": "Log Out",
    "Logg inn": "Log In",
    "Bli medlem!": "Become a Member!",
    "Meny": "Menu",
    "Laster inn...": "Loading...",
    "LagKlubb": "Create Club",
    "Velg Klubb": "Select Club",
    "Velg en klubb fra listen nedenfor.": "Select a club from the list below.",
    "Klubbside": "Club Page",
    "Medlemskap": "Membership",
    "Nyheter": "News",
    "Personvern": "Privacy",
    "Sikkerhet": "Security", 
    "Informasjonskapsler": "Cookies",
    "Kontakt oss": "Contact Us",
    "Om oss": "About Us",
    "Med over 18,000 baner verden over, er sporten i vekst og passer for spillere i alle aldre og ferdighetsnivåer.": "With over 18,000 courses worldwide, the sport is growing and suitable for players of all ages and skill levels.",
    "Disc golf er en spennende utendørs sport der målet er å kaste en frisbee i en kurv på færrest mulig kast. ": "Disc golf is an exciting outdoor sport where the goal is to throw a frisbee into a basket in the fewest possible throws.",
    "PoengTavler": "Scoreboards",
    "Brukernavn eller e-post er allerede registrert": "Username or email is already registered",
    "Feil ved registrering": "Registration error",
    "Registrering feilet. Prøv igjen.": "Registration failed. Please try again.",
    "Brukernavn må være 3-15 tegn langt og kun inneholde bokstaver og tall.": "Username must be 3-15 characters long and contain only letters and numbers.",
    "E-post må være gyldig": "Email must be valid",
    "Passord må være gyldig, (minst 8 tegn og maks 20 tegn og ha ett spesialtegn).": "Password must be valid (minimum 8 characters, maximum 20 characters, and include one special character).",
    "Passordene stemmer ikke overens.": "Passwords do not match.",
    "Tallet må være et gyldig tall.": "The number must be a valid number.",
    "Feil ved utlogging": "Logout error",
    "Utlogging feilet. Prøv igjen.": "Logout failed. Please try again.",
    "Registrer deg": "Register here",
    "Har du allerede en konto?" : "Already have an account?",
    "Registrer deg som bruker!" : "Register as a user!",
    "Noe gikk galt. Prøv igjen.": "Something went wrong. Please try again.",
    "Registreringsfeil": "Registration error",
    "Passord må være minst 8 tegn og maks 20 tegn og ha ett spesialtegn" : "Password must be at least 8 characters and a maximum of 20 characters and have one special character",
    "Tallet er riktig"  : "The number is correct",
    "Tallet er feil"  : "The number is incorrect",
    "Har du ikke konto? Opprett bruker her" : "Don't have an account? Create a user here",
    "Feil ved innlogging. Prøv igjen." : "Login error. Please try again.",
    "Innlogging vellykket" : "Login successful",
    "Innloggingsfeil" : "Login error",
    "Feil ved innlogging. Sjekk brukernavn og passord, prøv igjen deretter." : "Login error. Check username and password, then try again.",
    "Skriv inn enten brukernavn (3-15 tegn) eller en gyldig e-post." : "Enter either a username (3-15 characters) or a valid email.",
    "Passord må være minst 8 tegn og maks 20 tegn og ha ett spesialtegn." : "Password must be at least 8 characters and a maximum of 20 characters and have one special character.",
    "Glemt passord?" : "Forgot password?",
    "Brukernavn eller e-post ikke funnet" : "Username or email not found",
    "For mange registreringsforsøk, prøv igjen senere" : "Too many registration attempts, please try again later",
    "Brukernavn må fylles ut." : "Username must be filled out.",
    "Brukernavnet må være mellom 3 og 15 tegn." : "Username must be between 3 and 15 characters.",
    "Brukernavnet kan bare inneholde bokstaver og tall." : "Username can only contain letters and numbers.",
    "Passord må fylles ut." : "Password must be filled out.",
    "Passordet må være minst 8 tegn, maks 20 tegn." : "Password must be at least 8 characters, maximum 20 characters.",
    "Passordet må inneholde minst ett spesialtegn." : "Password must contain at least one special character.",
    "Passordene må være like." : "Passwords must match.",
    "Ugyldig tilbakestillingslenke. Sjekk e-posten din igjen for lenke." : "Invalid reset link. Check your email again for the link.",
    "Kunne ikke validere tilbakestillingslenken." : "Could not validate the reset link.",
    "Feil ved tilbakestilling av passord:" : "Error resetting password:",
    "Passord ble oppdatert!" : "Password updated!",
    "Feil ved passsordoppdatering." : "Error updating password.",
    "Validerer tilbakestillingslenke..." : "Validating reset link...",
    "Oppdaterer..." : "Updating...",
    "Denne tilbakestillingslenken er utløpt eller ugyldig." : "This reset link has expired or is invalid.",
    "Vennligst gå tilbake og be om en ny tilbakestillingslenke." : "Please go back and request a new reset link.",
    "Tilbake til innlogging" : "Back to login",
    "Feil ved sending" : "Error while sending", 
    "Feil ved sending av epost" : "Error while sending email",
    "E-post sendt! Sjekk innboksen din for tilbakestillingslenke." : "Email sent! Check your inbox for the reset link.",
    "En feil har skjedd" : "An error has occurred",
    "Noe gikk galt" : "Something went wrong",
    "Skriv inn tallet for å fortsette:" : "Enter the number to continue:",
    "Sender..." : "Sending...",
    "Send tilbakestillingslenke" : "Send reset link",
    "Epost eller brukernavn" : "Email or username",
    "E-post må fylles ut." : "Email must be filled out.",
    "E-posten må være gyldig." : "Email must be valid.",
    "Brukernavn eller e-post må fylles ut." : "Username or email must be filled out.",
    "Må være brukernavn (3-15 tegn) eller en gyldig e-post." : "Must be a username (3-15 characters) or a valid email.",
    "Nytt brukernavn må være mellom 3 og 15 tegn." : "New username must be between 3 and 15 characters.",
    "Nytt brukernavn kan bare inneholde bokstaver og tall." : "New username can only contain letters and numbers.",
    "E-post må være gyldig." : "Email must be valid.",
    "Passordet må inneholde minst én stor bokstav." : "Password must contain at least one uppercase letter.",
    "Du må oppgi ditt gamle passord hvis du vil endre passord." : "You must provide your old password if you want to change the password.",
    "Navn må være mellom 1 og 50 tegn." : "Name must be between 1 and 50 characters.",
    "Telefonnummer må være et gyldig format." : "Phone number must be in a valid format.",
    "Bosted må være mellom 1 og 100 tegn." : "Residence must be between 1 and 100 characters.",
    "Passordet må være minst 8 tegn, maks 20." : "Password must be at least 8 characters, maximum 20.",
    "Nytt passord må fylles ut." : "New password must be filled out.",
    "Passordet må inneholde minst en stor bokstav." : "Password must contain at least one uppercase letter.",
    "Skriv inn tallet for å registrere deg:" : "Enter the number to register:",
    "Skriv inn tallet for å logge inn: ": "Enter the number to log in:",
    "Logg deg inn!" : "Log in!",
    "Over 5,000 Baner": "Over 5,000 Courses",
    "Registrer resultater og forbedre din spillopplevelse": "Record scores and enhance your gaming experience",
    "Finn Bane": "Find Course",
    "Øk diskgolf opplevelsen din 🥏": "Enhance your disc golf experience 🥏",
    "Utforsk baner med venner": "Explore courses with friends",
    "Finn nye disc golf-baner, planlegg turer med venner, og opplev spennende utfordringer sammen!": "Discover new disc golf courses, plan trips with friends, and experience exciting challenges together!",
    "Delta i en klubb": "Join a club",
    "Bli med i en disc golf-klubb og bli en del av et engasjert fellesskap!": "Join a disc golf club and become part of an engaged community!",
    "Turneringer": "Tournaments",
    "Delta i spennende turneringer og utfordr deg selv sammen med andre disc golf-spillere!": "Participate in exciting tournaments and challenge yourself with other disc golf players!",
    "Sjekk værforholdene før du spiller!": "Check the weather conditions before you play!",
    "Slett testdata": "Delete test data",
    "logginn/registrer deg for å spille": "Log in/register to play",
    "Ingen baner tilgjengelig...": "No courses available...",
    "Antall hull": "Number of holes",
    "Tilstand": "Condition",
    "God": "Good",
    "Nivå": "Level",
    "Spill": "Play",
    "Rediger": "Edit",
    "Værvarsel for": "Weather forecast for",
    "valgt bane": "selected course",
    "Rating": "Rating",
    "Abonnement Info" : "Subscription Info",
    "Abonnement" : "Subscription",
    "Abonnenter" : "Subscribers",
    "Personvernserklæring": "Privacy Policy",
    "Sist oppdatert": "Last updated",
    "er behandlingsansvarlig for behandlingen av personopplysninger som beskrevet i denne erklæringen.": "is the data controller for the processing of personal data as described in this declaration.",
    " Denne personvernerklæringen gjelder for:": " This privacy policy applies to:",
    "1. Hvilke personopplysninger vi samler inn": "1. What personal data we collect",
    "Vi behandler følgende kategorier av personopplysninger:": "We process the following categories of personal data:",
    "Grunnleggende informasjon": "Basic information",
    "Brukernavn": "Username",
    "Kontaktinformasjon": "Contact information",
    "Navn, bosted og telefonnummer (hvis oppgitt frivillig av bruker)": "Name, residence, and phone number (if voluntarily provided by the user)",
    "Konto og profilinformasjon": "Account and profile information",
    "Passord, kontoinnstillinger": "Password, account settings",
    "Se vår": "See our",
    "informasjonskapsler-side": "cookies page",
    "2. Hvordan vi bruker personopplysningene": "2. How we use personal data",
    "Vi bruker dine opplysninger til:": "We use your data to:",
    "Å administrere kontoen din og gi deg tilgang til tjenesten.": "To manage your account and provide you with access to the service.",
    "Å ivareta sikkerheten og beskytte brukerne våre mot svindel.": "To ensure security and protect our users from fraud.",
    "Vi deler ikke dine personopplysninger med tredjeparter, med mindre det er nødvendig for å oppfylle en avtale med deg, eller vi er lovpålagt å gjøre det.": "We do not share your personal data with third parties unless it is necessary to fulfill an agreement with you or we are legally required to do so.",
    "3. Dine rettigheter": "3. Your rights",
    "Du har følgende rettigheter når det gjelder dine personopplysninger:": "You have the following rights regarding your personal data:",
    "Rett til innsyn": "Right of access",
    "Du kan be om en kopi av dine opplysninger.": "You can request a copy of your data.",
    "Rett til korrigering": "Right to rectification",
    "Du kan be oss rette feilaktige opplysninger.": "You can ask us to correct inaccurate data.",
    "Rett til sletting": "Right to delete",
    "Du kan be oss slette dine data (med unntak av data vi er pålagt å lagre).": "You can request that we delete your data (except data we are legally required to retain).",
    "Rett til dataportabilitet": "Right to data portability",
    "Du kan få utlevert dine data i et maskinlesbart format.": "You can receive your data in a machine-readable format.",
    "Har du spørsmål eller bekymringer angående rettighetene dine?": "Do you have any questions or concerns regarding your rights?",
    "4. Klage": "4. Complaint",
    "Hvis du mener vi ikke overholder personvernlovgivningen, kan du klage til Datatilsynet:": "If you believe we are not complying with data protection laws, you can file a complaint with the Norwegian Data Protection Authority:",
    "5. Rettslig grunnlag og lovgivning": "5. Legal basis and legislation",
    "Behandlingen av personopplysninger hos oss skjer i henhold til": "The processing of personal data with us is done in accordance with",
    "personopplysningsloven": "the Personal Data Act",
    "og": "and",
    "Du kan lese mer om lovverket og dine rettigheter på Datatilsynets nettsider:": "You can read more about the legislation and your rights on the website of the Norwegian Data Protection Authority:",
    "Om personopplysningsloven og når den gjelder": "About the Personal Data Act and when it applies",
    "6. Ønsker du å slette dine data?": "6. Want to delete your data?",
    "Du kan enkelt slette din konto og alle tilknyttede data ved å": "You can easily delete your account and all associated data by",
    "logge inn": "logging in",
    "deretter gå til Medlemskap → Brukerinnstillinger →": "then go to Membership → User Settings →",
    "Slett meg": "Delete me",
    "Sikkerhetstiltak": "Security Measures",
    "Vi tar sikkerhet på alvor og implementerer robuste tiltak for å beskytte både brukerdata og systemet vårt.": "We take security seriously and implement robust measures to protect both user data and our system.",
    "Kontinuerlig overvåkning": "Continuous Monitoring",
    "Alle aktiviteter logges og overvåkes for å oppdage uvanlige mønstre eller sikkerhetstrusler.": "All activities are logged and monitored to detect unusual patterns or security threats.",
    "Beskyttelse av data": "Data Protection",
    "Vi anvender sikre standarder for kryptering og lagring for å forhindre uautorisert tilgang.": "We use secure standards for encryption and storage to prevent unauthorized access.",
    "Sikre forbindelser": "Secure Connections",
    "All trafikk til og fra tjenesten skjer via sikre protokoller for å beskytte mot datalekkasjer.": "All traffic to and from the service occurs via secure protocols to protect against data leaks.",
    "Tilgangskontroll": "Access Control",
    "Strenge regler for autentisering og autorisasjon sikrer at kun autoriserte brukere har tilgang til sensitiv informasjon.": "Strict authentication and authorization rules ensure that only authorized users have access to sensitive information.",
    "Forebygging av angrep": "Attack Prevention",
    "Systemet er beskyttet mot vanlige angrep som brute-force, injeksjonsangrep og forsøk på uautorisert tilgang.": "The system is protected against common attacks such as brute force, injection attacks, and unauthorized access attempts.",
    "Hvis du har spørsmål eller bekymringer angående sikkerheten på vår nettside, kan du kontakte oss på:": "If you have questions or concerns regarding the security of our website, you can contact us at:",
    "1. Hva er informasjonskapsler?": "1. What are cookies?",
    "Informasjonskapsler er små tekstfiler som lagres på enheten din når du besøker en nettside. De brukes for å lagre informasjon mellom besøk.": "Cookies are small text files stored on your device when you visit a website. They are used to store information between visits.",
    "2. Hva er sesjoner?": "2. What are sessions?",
    "En sesjon er en midlertidig tilkobling mellom deg og nettsiden, og lagres trygt på vår server. Hos oss lagres sesjonsdata i databasen i inntil 5 dager, eller til du logger ut (eller ved forespørsel om sletting av data). Etter dette slettes de automatisk, og du må logge inn på nytt. Selve informasjonskapselen i nettleseren inneholder kun en ID, og ingen sensitiv informasjon.": "A session is a temporary connection between you and the website, securely stored on our server. We store session data for up to 5 days or until you log out (or request data deletion). After that, it's automatically deleted, and you will need to log in again. The cookie in your browser contains only an ID and no sensitive information.",
    "3. Hvilke informasjonskapsler bruker vi?": "3. Which cookies do we use?",
    "Vi bruker kun en informasjonskapsel som er nødvendig for at applikasjonen skal fungere som den skal:": "We only use one cookie necessary for the application to function properly:",
    "Denne informasjonskapselen opprettes automatisk ved innlogging, og brukes til å holde deg innlogget så lenge sesjonen varer. Den inneholder ingen personlig informasjon, og slettes når du logger ut eller etter en viss tids inaktivitet.": "This cookie is created automatically upon login and is used to keep you logged in as long as the session lasts. It contains no personal information and is deleted upon logout or after a period of inactivity.",
    "I tillegg benyttes informasjonskapsler som automatisk settes av tredjeparts API-er vi bruker, som f.eks. værdata fra": "Additionally, cookies may be set by third-party APIs we use, such as weather data from",
    "og karttjenester fra": "and map services from",
    "Disse brukes kun for å vise nødvendig funksjonalitet, som værmelding og interaktive kart, og ikke til sporing eller analyse.": "These are used only to display necessary functionality like weather forecasts and interactive maps, not for tracking or analytics.",
    "Vi bruker ikke analyse- eller markedsføringskapsler.": "We do not use analytics or marketing cookies.",
    "4. Hvordan administrerer jeg informasjonskapsler?": "4. How do I manage cookies?",
    "Du kan administrere og slette informasjonskapsler via innstillingene i nettleseren din. Hvis du sletter nødvendige informasjonskapsler, kan innlogging og enkelte funksjoner slutte å fungere.": "You can manage and delete cookies through your browser settings. If you delete essential cookies, login and certain features may stop working.",
    "5. Ønsker du å slette dine data?": "5. Do you wish to delete your data?",
    "Les mer her": "Read more here",
    "dersom du ønsker å slette dine data.": "if you want to delete your data.",
    "Ulike abonnementer vi tilbyr": "Subscription plans we offer",
    "1. Gratis medlemskap": "1. Free membership",
    "Vårt gratis medlemskap gir deg tilgang til grunnleggende funksjonalitet uten noen kostnader. Dette alternativet passer godt for nye brukere eller de som kun trenger enkel tilgang.": "Our free membership gives you access to basic features at no cost. This option is ideal for new users or those who need simple access.",
    "Tilgang til grunnleggende funksjoner": "Access to basic features",
    "Ingen månedlig kostnad": "No monthly cost",
    "Begrenset kundestøtte": "Limited customer support",
    "2. Betalt medlemskap": "2. Paid membership",
    "Med betalt medlemskap får du full tilgang til alle funksjoner og prioritet hos kundestøtte. Dette er det beste valget for aktive brukere som ønsker maksimal verdi.": "With a paid membership, you get full access to all features and priority customer support. This is the best option for active users who want maximum value.",
    "Full tilgang til alle funksjoner": "Full access to all features",
    "Prioritert kundestøtte": "Priority customer support",
    "Pris: 99 kr/måned": "Price: 99 NOK/month",
    "Du kan administrere eller oppgradere abonnementet ditt via underkategorien \"Mitt abonnement\" ved ditt medlemskap når som helst.": "You can manage or upgrade your subscription via the \"My subscription\" subcategory under your membership at any time.",
    "Hva er DiscGolf?": "What is DiscGolf?",
    "DiscGolf, også kjent som frisbeegolf...": "DiscGolf, also known as frisbee golf, is a sport where players throw a disc (frisbee) at a metal basket. The goal is to complete each course with as few throws as possible – similar to traditional golf. The sport is easy to learn, inexpensive to start, and suitable for all ages.",
    "Spillets gang": "How the game works",
    "Spillet starter fra et utslagssted...": "The game starts from a tee pad, and you throw from where the disc lands.",
    "Hullet er fullført når disken havner i kurven...": "The hole is completed when the disc lands in the basket or hits the chains.",
    "Hvis disken havner utenfor banen...": "If the disc goes out of bounds (OB), you receive a penalty throw and continue from the point it went out.",
    "Man skal vise hensyn...": "Players should respect others and clean up after themselves.",
    "Det brukes ulike typer disker:": "Different types of discs are used:",
    "drivere": "drivers",
    "midrange": "midrange",
    "puttere": "putters",
    "for lange kast,": "for long throws,",
    "for mellomdistanse og": "for mid-range shots and",
    "for korte, presise kast mot kurven.": "for short, precise throws toward the basket.",
    "Poengsystem": "Scoring system",
    "Birdie": "Birdie",
    "Ett kast under par (-1)": "One throw under par (-1)",
    "Par": "Par",
    "Forventet antall kast (0)": "Expected number of throws (0)",
    "Bogey": "Bogey",
    "Ett kast over par (+1)": "One throw over par (+1)",
    "Eagle / Albatross": "Eagle / Albatross",
    "To eller tre kast under par (-2, -3)": "Two or three throws under par (-2, -3)",
    "Trippel-/Dobbelbogey": "Triple/Double bogey",
    "Flere kast over par (+2, +3 osv.)": "Several throws over par (+2, +3 etc.)",
    "Vil du lære mer?": "Want to learn more?",
    "For en full oversikt over reglene kan du lese mer hos:": "For a complete overview of the rules, you can read more at:",
    "Wikipedia – Diskgolf": "Wikipedia – Disc golf",
    "Om DiscGolf": "About DiscGolf",
    "DiscGolf, også kjent som frisbeegolf, er en sport der man kaster en disc (frisbee) mot en metallkurv. Målet er å fullføre hver bane med færrest mulig kast – akkurat som i vanlig golf. Sporten er enkel å lære, rimelig å komme i gang med, og kan spilles av alle aldre." : "DiscGolf, also known as frisbee golf, is a sport where players throw a disc (frisbee) at a metal basket. The goal is to complete each course with as few throws as possible – similar to traditional golf. The sport is easy to learn, inexpensive to start, and suitable for all ages.",
    "E-post" : "Email",
    "Passord" : "Password",
    "Bekreft passord" : "Confirm password",
    "vellykket" : "successful",
    "Laster..." : "Loading...",
    "Skriv inn tallet" : "Enter the number",
    "Brukernavn eller e-post" : "Username or email",
    "Vi behandler personopplysninger i samsvar med personopplysningsloven og GDPR." : "We process personal data in accordance with the Personal Data Act and GDPR.",
    "Har du allerede en konto? Klikk her" : "Already have an account? Click here",
    "Innlogging vellykket!" : "Login successful!",
    "Registrering vellykket! Du blir omdirigert til innlogging..." : "Registration successful! You will be redirected to login...",
    "Vi bruker kun nødvendige informasjonskapsler for å forbedre brukeropplevelsen og sørge for at nettsiden fungerer optimalt. Ved å benytte nettsiden godtar du vår bruk av informasjonskapsler." : "We only use necessary cookies to improve the user experience and ensure that the website functions optimally. By using the website, you accept our use of cookies.",
    "Feil ved passordoppdatering" : "Error updating password",
    "Passordet er oppdatert!" : "Password is updated!",
    "Jeg har lest" : "I have read",
    "Les mer" : "Read more",
    "Passord må være minst 8 tegn og maks 20 tegn og ha minst en stor bokstav og spesialtegn." : "Password must be at least 8 characters and a maximum of 20 characters and have at least one uppercase letter and special character.",
    "Baneliste": "Course List",
    "Velg bane": "Select course",
    "Vis baner i nærheten": "Show nearby courses",
    "Viser baner i nærheten": "Showing nearby courses",
    "Avstand": "Distance",
    "Alle baner": "All courses",
    "Alle hull": "All holes",
    "1 hull": "1 hole",
    "2 hull": "2 holes",
    "3 hull": "3 holes",
    "4 hull": "4 holes",
    "5 hull": "5 holes",
    "6+ hull": "6+ holes",
    "Tilstand: God": "Condition: Good",
    "Anmeldelser": "Reviews",
    "Beskrivelse": "Description",
    "Antall hull:": "Number of holes:",
    "Tilstand:": "Condition:",
    "Nivå:": "Level:",
    "Værmelding": "Weather forecast",
    "Vurdering:": "Rating:",
    "Din vurdering:": "Your rating:",
    "Du har valgt {rating} stjerne": "You have selected {rating} star",
    "Du har valgt {rating} stjerner": "You have selected {rating} stars",
    "Din kommentar:": "Your comment:",
    "Legg til anmeldelse": "Add review",
    "Laster anmeldelser...": "Loading reviews...",
    "Ingen anmeldelser ennå": "No reviews yet",
    "Anmeldelser:": "Reviews:",
    "Du må være logget inn for å legge til en anmeldelse": "You must be logged in to add a review",
    "Vennligst velg en vurdering mellom 1 og 5": "Please select a rating between 1 and 5",
    "Anmeldelse lagt til!": "Review added!",
    "Kunne ikke hente anmeldelser": "Could not fetch reviews",
    "Kunne ikke legge til anmeldelse": "Could not add review",
    "anmeldelse": "review",
    "anmeldelser": "reviews", 
    "Velg en klubb": "Choose a club",
    "Ikke registrert klubb?": "Not registered with a club?",
    "Opprett ny klubb her": "Create a new club here",
    "Velg en klubb du skal redigere side for:": "Choose a club you want to edit the page for:",
    "Klubber:": "Clubs:",
    "Velg klubb": "Choose club",
    "Velg klubb..": "Choosing club..", 
    "Klubb": "Club",
    "Kontaktinfo": "Contact Info",
    "Nyhet": "News",
    "Bane": "Course",
    "Turnering": "Tournament",
    "Rediger Bane": "Edit Course",
    "Legg til nyheter": "Add News",
    "Nyhetstittel": "News Title",
    "Last opp pdf": "Upload PDF",
    "Velg fil": "Choose File",
    "Ingen fil valgt": "No file selected",
    "Legg til nyhet": "Add News",
    "Legg til nyhet..": "Adding News..", 
    "Opprett ny turnering": "Create new tournament",
    "Navn": "Name",
    "Dato": "Date",
    "Skriv inn navn på turneringen": "Enter the name of the tournament",
    "Skriv inn navnet på banen": "Enter the name of the course",
    "Skriv inn en kort beskrivelse av turneringen": "Enter a short description of the tournament",
    "Lagrer...": "Saving...",
    "Opprett turnering": "Create tournament", 
    "Hull": "Hole",
    "Start og sluttposisjon": "Start and end position",
    "Trykk en gang for å velge startposisjon (utslagssted).": "Click once to select the start position (tee).",
    "Deretter trykk en gang for å velge sluttposisjon (kurv).": "Then click once to select the end position (basket).",
    "Hold Alt og klikk for å markere OB-soner (min/maks 3 punkter for å opprette en sone).": "Hold Alt and click to mark OB zones (min/max 3 points to create a zone).",
    "Legg til hull": "Add hole",
    "Fullfør Registrering": "Complete Registration",
    "Vanskelighetsgrad": "Difficulty level",
    "Lett": "Easy",
    "Middels": "Medium",
    "Vanskelig": "Hard",
    "Beskriv banen": "Describe the course",
    "Plassering": "Location",
    "Lagre bane": "Save course", 
    "Laster baneinformasjon...": "Loading course information...",
    "Rediger banen her": "Edit the course here",
    "Banenavn": "Course name",
    "Vanskelighet": "Difficulty",
    "Rediger hull": "Edit hole",
    "Angre": "Undo",
    "Fullfør": "Complete",
    "Gamle posisjoner blir overskrevet.": "Old positions will be overwritten.",
    "<-": "<-",
    "->": "->", 
    "Se klubbsiden her": "View the club page here", 
    "Medlemmer": "Members",
    "Rolle": "Role",
    "Bruker": "User",
    "kontaktinfo": "Contact Info",
    "Ingen medlemmer funnet.": "No members found.", 
    "Du må være innlogget for å kommentere.": "You must be logged in to comment.",
    "Vennligst fyll inn kommentar.": "Please fill in a comment.",
    "Kommentar lagt til!": "Comment added!",
    "Last ned PDF": "Download PDF",
    "Kommenter": "Comment",
    "Skriv en kommentar...": "Write a comment...",
    "Send": "Send",
    "Kommentarer": "Comments",
    "Ingen kommentarer ennå.": "No comments yet.",
    "Ingen nyheter tilgjengelig...": "No news available...", 
    "Legg Til en klubb": "Add a club",
    "Har allerede en klubb?": "Already have a club?",
    "Klubbnavn": "Club name",
    "Mailadresse": "Email address",
    "Legg til klubb": "Add club",
    "Legger til klubb..": "Adding club..", 
    "Bli medlem": "Join club",
    "Medlem": "Member",
    "Ikke medlem": "Not a member", 
    "Oppdateringer": "Updates",
    "Her er dine siste varsler.": "Here are your latest notifications.",
    "Ukjent tittel": "Unknown title",
    "Ukjent klubb": "Unknown club",
    "Se nyheten her": "View the news here",
    "Invitasjon til runde": "Invitation to round",
    "Avsender": "Sender",
    "Ikke definert": "Not defined",
    "Ukjent varslingstype": "Unknown notification type",
    "Ingen varsler tilgjengelig.": "No notifications available.", 
    "sin statistikk": "statistics",
    "Statistikk": "Statistics",
    "Poengtavler": "Scoreboards",
    "Poengkort fra": "Scorecard from",
    "Spiller": "Player",
    "Antall kast": "Number of throws",
    "Total Poengsum": "Total Score",
    "Ingen spillere tilgjengelig": "No players available",
    "Ingen poengtavler tilgjengelig...": "No scoreboards available...",
    "Antall runder": "Number of rounds",
    "Gjennomsnittlig score": "Average score",
    "Antall kast totalt": "Total number of throws",
    "Gjennomsnittlig kast pr.runde": "Average throws per round",
    "Beste score": "Best score",
    "Antall hole in one": "Number of hole-in-ones",
    "Sletter bruker, vennligst vent..." : "Deleting user, please wait...",
    "Min informasjon": "My Information",
    "Endre min informasjon": "Edit My Information",
    "Slett bruker": "Delete User",
    "Her er din registrerte brukerinformasjon": "Here is your registered user information",
    "Du er registrert som: {{rolle}} og har tilgang til ulike funksjoner.": "You are registered as: {{rolle}} and have access to various features.",
    "Endre brukerinformasjon": "Edit user information",
    "Brukerkonto:": "User account:",
    "Personlig informasjon:": "Personal information:",
    "Endre passord:": "Change password:",
    "Nåværende passord (oppgis ved endring av passord)": "Current password (required to change password)",
    "Nytt passord (valgfritt)": "New password (optional)",
    "Lagre Endringer": "Save Changes",
    "Bekreft sletting": "Confirm deletion",
    "Denne handlingen kan ikke angres!": "This action cannot be undone!",
    "Skriv inn brukernavn eller epost": "Enter username or email",
    "Bekreft Sletting": "Confirm Deletion",
    "Avbryt": "Cancel",
    "Velg en underkategori for ditt behov": "Select a subcategory for your needs",
    "Fyll inn brukernavn/e-post og passord.": "Please enter username/email and password.",
    "Feil ved sletting av bruker, sjekk brukernavn/epost og passord, prøv igjen deretter.": "Error deleting user, check username/email and password and try again.",
    "Brukernavn og e-post kan ikke være tomme.": "Username and email cannot be empty.",
    "Fornavn, etternavn og bosted kan kun inneholde bokstaver.": "First name, last name and residence can only contain letters.",
    "Du må oppgi ditt nåværende passord for å endre til nytt passord.": "You must enter your current password to change to a new password.",
    "Mitt abonnement": "My subscription",
    "Abonnementsinformasjon": "Subscription Information",
    "Gratis medlemskap": "Free membership",
    "Betalt medlemskap": "Paid membership",
    "99 kr/måned": "99 NOK/month",
    "Du har betalt for medlemskapet!": "You have paid for the membership!",
    "Avslutt abonnement": "Cancel subscription",
    "Betal nå": "Pay now",
    "Behandler...": "Processing...",
    "Behandler betaling...": "Processing payment...",
    "Betaling feilet": "Payment failed",
    "Feil ved betaling:": "Error during payment:",
    "Avslutting av abonnement feilet": "Subscription cancellation failed",
    "Feil ved avslutting av abonnement:": "Error during subscription cancellation:",
    "To-faktor autentisering": "Two-factor authentication",
    "2FA(Ikke implementert)": "2FA (Not implemented)",
    "Gjennoppretting": "Recovery",
    "Gjenoppretting(Ikke implementert)": "Recovery (Not implemented)",
    "Informasjonskapsler (Ikke implementert)": "Cookies (Not implemented)",
    "Synlighet": "Visibility",
    "Synlighetsinnstillinger (Ikke implementert)": "Visibility settings (Not implemented)",
    "Innstillinger": "Settings",    
    "Systeminnstillinger": "Systemsettings",
    "Globale innstillinger": "Global settings",
    "Brukeradministrasjon": "Usermanagement",
    "Systemlogg": "Systemlog",
    "Administrasjon": "Administration",
    "AdminDashboard": "AdminDashboard",
    "Administrere klubber": "Administrate clubs",
    "Klubbinnstillinger": "Clubsettings",
    "Administrere medlem": "Administrate member",
    "Brukerinnstillinger": "Usersettings",
    "Min Klubb": "My Club",
    "Søk etter klubb": "Search for club",
    "Søk etter brukere": "Search for users",
    "Om Oss": "About Us",
    "Hvem er vi?": "Who are we?",
    "Vår visjon": "Our vision",
    "Hva tilbyr vi?": "What do we offer?",
    "Hvorfor velge oss?": "Why choose us?",
    "Spill og lagre opplevelser": "Play and save experiences",
    "Delta i turneringer": "Participate in tournaments",
    "Opprett klubber": "Create clubs",
    "Bli med i en klubb": "Join a club",
    "Kontaktskjema": "Contact form",
    "Vi er Discgolf Bø, en gruppe entusiastiske studenter fra Bø som har som mål å gjøre discgolf enda mer engasjerende og tilgjengelig for alle. Vår lidenskap for sporten og ønsket om å skape en bedre opplevelse for spillere har ført til utviklingen av vår webapplikasjon.":
        "We are Discgolf Bø, a group of enthusiastic students from Bø who aim to make disc golf more engaging and accessible for everyone. Our passion for the sport and desire to create a better experience for players has led to the development of our web application.",
    "Vi ønsker å gjøre discgolf til en sosial og konkurransedyktig sport der alle, uavhengig av erfaring, kan delta, lære og ha det gøy. Gjennom vår plattform ønsker vi å knytte sammen spillere, klubber og turneringer på en enkel og effektiv måte.":
        "We want to make disc golf a social and competitive sport where everyone, regardless of experience, can participate, learn, and have fun. Through our platform, we aim to connect players, clubs, and tournaments in a simple and efficient way.",
    "Med vår app kan du enkelt registrere og lagre dine discgolf-runders resultater. Følg fremgangen din over tid og del opplevelsene med venner.":
        "With our app, you can easily record and save the results of your disc golf rounds. Track your progress over time and share experiences with friends.",
    "Bli med i spennende turneringer arrangert av klubber eller andre spillere. Hold deg oppdatert på kommende arrangementer og meld deg på med noen få klikk.":
        "Join exciting tournaments organized by clubs or other players. Stay updated on upcoming events and sign up with just a few clicks.",
    "Har du lyst til å starte din egen discgolf-klubb? Gjør det enkelt gjennom vår nettside! Inviter medlemmer, arranger turneringer og bygg et lokalt discgolf-miljø.":
        "Want to start your own disc golf club? Do it easily through our website! Invite members, organize tournaments, and build a local disc golf community.",
    "Søk opp klubber i ditt område og bli medlem for å delta i aktiviteter, turneringer og sosialt samvær med andre discgolf-entusiaster.":
        "Search for clubs in your area and join to participate in activities, tournaments, and social events with other disc golf enthusiasts.",
    "Vi er dedikerte til å skape en plattform som er enkel å bruke, men samtidig kraftig nok til å møte behovene til både nybegynnere og erfarne spillere. Vårt fokus er på fellesskap, læring og gode opplevelser på banen.":
        "We are dedicated to creating a platform that is easy to use yet powerful enough to meet the needs of both beginners and experienced players. Our focus is on community, learning, and great experiences on the course.",
    "Har du spørsmål, tilbakemeldinger eller ønsker å samarbeide med oss? Ta gjerne kontakt oss via:":
        "Do you have questions, feedback, or want to collaborate with us? Feel free to reach out to us via:"
}
